Kendrick/app/controllers/users_controller.rb

INSERT INTO "users" ("artist", "bio", "created_at", "email_address", "first_name", "last_name", "password_digest", "soundcloud_profile", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save